test/dummy/app/controllers/home_controller.rb

INSERT INTO "carriage_lists" ("created_at", "description", "fields", "name", "updated_at") VALUES ('2026-07-10 19:22:50.145627', 'Demo list used by the dummy app''s homepage signup form.', '[]', 'Product Updates', '2026-07-10 19:22:50.145627') RETURNING "id"
---
  def index
    @list = Carriage::List.find_or_create_by!(name: "Product Updates") do |list|